DATA AGGREGATION NOT IN , AND , OR ,IN ,ALAIS

In [3]:
%load_ext sql
%sql mysql+mysqlconnector://root:root@localhost/test

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [4]:
%%sql
create database customer_det;

 * mysql+mysqlconnector://root:***@localhost/test
1 rows affected.

[]

In [5]:
%%sql
CREATE TABLE CustomerTransactions (
    id INT PRIMARY KEY,
    login_device VARCHAR(50),
    customer_name VARCHAR(100),
    ip_address VARCHAR(20),
    product VARCHAR(100),
    amount DECIMAL(10, 2),
    is_placed BOOLEAN,
    is_viewed BOOLEAN,
    transaction_status VARCHAR(20)
);

 * mysql+mysqlconnector://root:***@localhost/test
0 rows affected.

[]

In [7]:
%%sql
INSERT INTO CustomerTransactions VALUES
(1, 'Mobile', 'Ravi', '192.168.1.1', 'Laptop', 50000.00, TRUE, FALSE, 'Completed'),
(2, 'Desktop', 'Priya', '192.168.1.2', 'Smartphone', 20000.00, TRUE, TRUE, 'Completed'),
(3, 'Tablet', 'Arjun', '192.168.1.3', 'Headphones', 1500.00, FALSE, TRUE, 'Failed'),
(4, 'Mobile', 'Meena', '192.168.1.4', 'Shoes', 2500.00, TRUE, FALSE, 'Completed'),
(5, 'Desktop', 'Karthik', '192.168.1.5', 'Watch', 5000.00, TRUE, TRUE, 'Completed'),
(6, 'Mobile', 'Sowmya', '192.168.1.6', 'Tablet', 15000.00, TRUE, TRUE, 'Completed'),
(7, 'Tablet', 'Ramesh', '192.168.1.7', 'Smartphone', 25000.00, FALSE, TRUE, 'Failed'),
(8, 'Desktop', 'Divya', '192.168.1.8', 'Laptop', 60000.00, TRUE, FALSE, 'Completed'),
(9, 'Mobile', 'Arun', '192.168.1.9', 'Smartwatch', 12000.00, TRUE, TRUE, 'Completed'),
(10, 'Tablet', 'Deepa', '192.168.1.10', 'Laptop', 55000.00, FALSE, FALSE, 'Pending');

 * mysql+mysqlconnector://root:***@localhost/test
10 rows affected.

[]

In [8]:
%%sql
select*from CustomerTransactions

 * mysql+mysqlconnector://root:***@localhost/test
10 rows affected.

[(1, 'Mobile', 'Ravi', '192.168.1.1', 'Laptop', Decimal('50000.00'), 1, 0, 'Completed'),
 (2, 'Desktop', 'Priya', '192.168.1.2', 'Smartphone', Decimal('20000.00'), 1, 1, 'Completed'),
 (3, 'Tablet', 'Arjun', '192.168.1.3', 'Headphones', Decimal('1500.00'), 0, 1, 'Failed'),
 (4, 'Mobile', 'Meena', '192.168.1.4', 'Shoes', Decimal('2500.00'), 1, 0, 'Completed'),
 (5, 'Desktop', 'Karthik', '192.168.1.5', 'Watch', Decimal('5000.00'), 1, 1, 'Completed'),
 (6, 'Mobile', 'Sowmya', '192.168.1.6', 'Tablet', Decimal('15000.00'), 1, 1, 'Completed'),
 (7, 'Tablet', 'Ramesh', '192.168.1.7', 'Smartphone', Decimal('25000.00'), 0, 1, 'Failed'),
 (8, 'Desktop', 'Divya', '192.168.1.8', 'Laptop', Decimal('60000.00'), 1, 0, 'Completed'),
 (9, 'Mobile', 'Arun', '192.168.1.9', 'Smartwatch', Decimal('12000.00'), 1, 1, 'Completed'),
 (10, 'Tablet', 'Deepa', '192.168.1.10', 'Laptop', Decimal('55000.00'), 0, 0, 'Pending')]

NOW COUNT operation

In [9]:
%%sql
select count(*) from CustomerTransactions

 * mysql+mysqlconnector://root:***@localhost/test
1 rows affected.

[(10,)]

In [10]:
%%sql
select count(*) from CustomerTransactions where transaction_status='Completed'

 * mysql+mysqlconnector://root:***@localhost/test
1 rows affected.

[(7,)]

In [17]:
%%sql
select*from CustomerTransactions where transaction_status='Completed' order by id desc;

 * mysql+mysqlconnector://root:***@localhost/test
7 rows affected.

[(9, 'Mobile', 'Arun', '192.168.1.9', 'Smartwatch', Decimal('12000.00'), 1, 1, 'Completed'),
 (8, 'Desktop', 'Divya', '192.168.1.8', 'Laptop', Decimal('60000.00'), 1, 0, 'Completed'),
 (6, 'Mobile', 'Sowmya', '192.168.1.6', 'Tablet', Decimal('15000.00'), 1, 1, 'Completed'),
 (5, 'Desktop', 'Karthik', '192.168.1.5', 'Watch', Decimal('5000.00'), 1, 1, 'Completed'),
 (4, 'Mobile', 'Meena', '192.168.1.4', 'Shoes', Decimal('2500.00'), 1, 0, 'Completed'),
 (2, 'Desktop', 'Priya', '192.168.1.2', 'Smartphone', Decimal('20000.00'), 1, 1, 'Completed'),
 (1, 'Mobile', 'Ravi', '192.168.1.1', 'Laptop', Decimal('50000.00'), 1, 0, 'Completed')]

In [18]:
%%sql
select count(*) from CustomerTransactions where transaction_status='Completed' and amount >'20000'

 * mysql+mysqlconnector://root:***@localhost/test
1 rows affected.

[(2,)]

In [19]:
%%sql
select * from CustomerTransactions where transaction_status='Completed' and amount >'20000'

 * mysql+mysqlconnector://root:***@localhost/test
2 rows affected.

[(1, 'Mobile', 'Ravi', '192.168.1.1', 'Laptop', Decimal('50000.00'), 1, 0, 'Completed'),
 (8, 'Desktop', 'Divya', '192.168.1.8', 'Laptop', Decimal('60000.00'), 1, 0, 'Completed')]

In [20]:
%%sql
select count(*) from CustomerTransactions where transaction_status in ('Failed','Pending')

 * mysql+mysqlconnector://root:***@localhost/test
1 rows affected.

[(3,)]

In [24]:
%%sql
select*from CustomerTransactions where transaction_status in ('Failed','Pending') order by  id

 * mysql+mysqlconnector://root:***@localhost/test
3 rows affected.

[(3, 'Tablet', 'Arjun', '192.168.1.3', 'Headphones', Decimal('1500.00'), 0, 1, 'Failed'),
 (7, 'Tablet', 'Ramesh', '192.168.1.7', 'Smartphone', Decimal('25000.00'), 0, 1, 'Failed'),
 (10, 'Tablet', 'Deepa', '192.168.1.10', 'Laptop', Decimal('55000.00'), 0, 0, 'Pending')]

In [25]:
%%sql
select*from CustomerTransactions where transaction_status not in ('Failed','Pending') order by  id

 * mysql+mysqlconnector://root:***@localhost/test
7 rows affected.

[(1, 'Mobile', 'Ravi', '192.168.1.1', 'Laptop', Decimal('50000.00'), 1, 0, 'Completed'),
 (2, 'Desktop', 'Priya', '192.168.1.2', 'Smartphone', Decimal('20000.00'), 1, 1, 'Completed'),
 (4, 'Mobile', 'Meena', '192.168.1.4', 'Shoes', Decimal('2500.00'), 1, 0, 'Completed'),
 (5, 'Desktop', 'Karthik', '192.168.1.5', 'Watch', Decimal('5000.00'), 1, 1, 'Completed'),
 (6, 'Mobile', 'Sowmya', '192.168.1.6', 'Tablet', Decimal('15000.00'), 1, 1, 'Completed'),
 (8, 'Desktop', 'Divya', '192.168.1.8', 'Laptop', Decimal('60000.00'), 1, 0, 'Completed'),
 (9, 'Mobile', 'Arun', '192.168.1.9', 'Smartwatch', Decimal('12000.00'), 1, 1, 'Completed')]

In [30]:
%%sql
select sum(amount) from CustomerTransactions where transaction_status='Completed'

 * mysql+mysqlconnector://root:***@localhost/test
1 rows affected.

[(Decimal('164500.00'),)]

ALAIS AS , WE CAN GIVE ALTERNATE NAME FOR THIS COLUMN AS WE NEED

In [31]:
%%sql
select sum(amount) as total_transaction from Customertransactions where transaction_status='completed'

 * mysql+mysqlconnector://root:***@localhost/test
1 rows affected.

[(Decimal('164500.00'),)]

In [33]:
%%sql
select min(amount) as minimum_amount from Customertransactions where transaction_status='completed'

 * mysql+mysqlconnector://root:***@localhost/test
1 rows affected.

[(Decimal('2500.00'),)]

In [34]:
%%sql
select max(amount) as maximum_amount from Customertransactions where transaction_status='completed'

 * mysql+mysqlconnector://root:***@localhost/test
1 rows affected.

[(Decimal('60000.00'),)]

In [37]:
%%sql
select avg(amount) as avg_amount from Customertransactions where transaction_status='completed'

 * mysql+mysqlconnector://root:***@localhost/test
1 rows affected.

[(Decimal('23500.000000'),)]

In [38]:
%%sql
select avg(amount) as avg_amount from Customertransactions;

 * mysql+mysqlconnector://root:***@localhost/test
1 rows affected.

[(Decimal('24600.000000'),)]

GROUP BY- without data aggregation if you are adding an column then you should use group by

you can also use alais as in the part of non aggregation

In [45]:
%%sql
select  login_device as user,
sum(amount) as total_trans_by_device from Customertransactions 
group by login_device;

 * mysql+mysqlconnector://root:***@localhost/test
3 rows affected.

[('Mobile', Decimal('79500.00')),
 ('Desktop', Decimal('85000.00')),
 ('Tablet', Decimal('81500.00'))]

HAVING- this is the condition used instead of where , because after data aggregation where can't be used so where makes raw condition
but HAVING works both condition and for also data aggregation, HAVING is used to declare condition

In [47]:
%%sql
select login_device as user,
sum(amount) from Customertransactions
group by login_device
having
sum(amount) > 80000;

 * mysql+mysqlconnector://root:***@localhost/test
2 rows affected.

[('Desktop', Decimal('85000.00')), ('Tablet', Decimal('81500.00'))]

CASE CONDITION - this is similar to if else condition such as case.

    -> case starts with keyword CASE where as ends with keyword END
     -> in between it contain WHEN & THEN (if) with respective condition , ELSE (else-part) condition or either true or false.

In [51]:
%%sql
CREATE TABLE CustomerData (
    id INT PRIMARY KEY,
    customer_name VARCHAR(100),
    email VARCHAR(100),
    phone_number VARCHAR(15),
    address VARCHAR(200),
    amount DECIMAL(10, 2)
);

 * mysql+mysqlconnector://root:***@localhost/test
0 rows affected.

[]

In [52]:
%%sql
INSERT INTO CustomerData VALUES
(1, 'Ravi', 'ravi@example.com', '98765', 'Chennai', 5000.00),
(2, 'Priya', NULL, '98765', 'Bangalore', NULL),
(3, 'Arjun', 'arjun@example.com', NULL, 'Hyderabad', 1500.00),
(4, 'Meena', NULL, NULL, 'Mumbai', 2500.00),
(5, 'Karthik', 'karthik@example.com', '98765', NULL, 3000.00);

 * mysql+mysqlconnector://root:***@localhost/test
5 rows affected.

[]

In [53]:
%%sql
select *from CustomerData;

 * mysql+mysqlconnector://root:***@localhost/test
5 rows affected.

[(1, 'Ravi', 'ravi@example.com', '98765', 'Chennai', Decimal('5000.00')),
 (2, 'Priya', None, '98765', 'Bangalore', None),
 (3, 'Arjun', 'arjun@example.com', None, 'Hyderabad', Decimal('1500.00')),
 (4, 'Meena', None, None, 'Mumbai', Decimal('2500.00')),
 (5, 'Karthik', 'karthik@example.com', '98765', None, Decimal('3000.00'))]

example case hard code , if we didn't use alais as , it shows enitire code so use alais as

In [56]:
%%sql
select
case
    when 8>10 then 'true'
    when 10>8 then 'yes'
    else 'false'
end as test

 * mysql+mysqlconnector://root:***@localhost/test
1 rows affected.

[('yes',)]

In this data we we are using case to find how much the customer spends money , is he is an high spender or an budget guy

In [58]:
%%sql
select customer_name , amount,
case
    when amount> 3700 then 'high spender'
    when amount between 2000 and 3700 then 'middle spender'
    when amount < 2000 then 'low spender'
    else 'no data'
end as spenders
from CustomerData;

 * mysql+mysqlconnector://root:***@localhost/test
5 rows affected.

[('Ravi', Decimal('5000.00'), 'high spender'),
 ('Priya', None, 'no data'),
 ('Arjun', Decimal('1500.00'), 'low spender'),
 ('Meena', Decimal('2500.00'), 'middle spender'),
 ('Karthik', Decimal('3000.00'), 'middle spender')]

In the above query , we have used 3 condition 

BETWEEN - this used as range in the eg we can clearly see there is an range so for the rangeuse between 

column between value and value

Now we are going to get the email those who didn't have phone numbers

In [64]:
%%sql
select 	customer_name ,phone_number,
case
    when email is null and phone_number is null then '999'
    when phone_number  is null then email
    else phone_number
end as contact
from CustomerData;

 * mysql+mysqlconnector://root:***@localhost/test
5 rows affected.

[('Ravi', '98765', '98765'),
 ('Priya', '98765', '98765'),
 ('Arjun', None, 'arjun@example.com'),
 ('Meena', None, '999'),
 ('Karthik', '98765', '98765')]

In the above code we have used IS fn it is to match the given condition , so we got email for contact , those who didn't have email then it should return phone number


PRO TIP: = ALWAYS USE LIMIT FOR VIEWING THE TABLE , ALL THE DATA'S USED ARE READ AND WRITE BY CLOUD SO ALWAYS USE LIMIT EXAMPLE

In [65]:
%%sql
select*from CustomerData limit 3

 * mysql+mysqlconnector://root:***@localhost/test
3 rows affected.

[(1, 'Ravi', 'ravi@example.com', '98765', 'Chennai', Decimal('5000.00')),
 (2, 'Priya', None, '98765', 'Bangalore', None),
 (3, 'Arjun', 'arjun@example.com', None, 'Hyderabad', Decimal('1500.00'))]

NULL HANDLING

now we are going to handle null value  both real null values which is empty and also fake null values , which means inserting
null as an string into db

there are two ways to handle by using
1. IS NULL
2. IS NOT NULL

and also to get inserted string based null values use where condition

In [66]:
%%sql
select*from CustomerData

 * mysql+mysqlconnector://root:***@localhost/test
5 rows affected.

[(1, 'Ravi', 'ravi@example.com', '98765', 'Chennai', Decimal('5000.00')),
 (2, 'Priya', None, '98765', 'Bangalore', None),
 (3, 'Arjun', 'arjun@example.com', None, 'Hyderabad', Decimal('1500.00')),
 (4, 'Meena', None, None, 'Mumbai', Decimal('2500.00')),
 (5, 'Karthik', 'karthik@example.com', '98765', None, Decimal('3000.00'))]

In [67]:
%%sql
select count(*) from CustomerData where amount is null;

 * mysql+mysqlconnector://root:***@localhost/test
1 rows affected.

[(1,)]

In [68]:
%%sql
select count(*) from CustomerData where amount is not null;

 * mysql+mysqlconnector://root:***@localhost/test
1 rows affected.

[(4,)]

In [69]:
%%sql
select* from CustomerData where amount is not null;

 * mysql+mysqlconnector://root:***@localhost/test
4 rows affected.

[(1, 'Ravi', 'ravi@example.com', '98765', 'Chennai', Decimal('5000.00')),
 (3, 'Arjun', 'arjun@example.com', None, 'Hyderabad', Decimal('1500.00')),
 (4, 'Meena', None, None, 'Mumbai', Decimal('2500.00')),
 (5, 'Karthik', 'karthik@example.com', '98765', None, Decimal('3000.00'))]

In [73]:
%%sql
insert into CustomerData (id	,customer_name	,email	,phone_number	,address	,amount)
values
(6,'Nithesh', 'nk@gmail.com','8765449076','Chennai',4000.00);

 * mysql+mysqlconnector://root:***@localhost/test
(mysql.connector.errors.IntegrityError) 1062 (23000): Duplicate entry '6' for key 'customerdata.PRIMARY'
[SQL: insert into CustomerData (id	,customer_name	,email	,phone_number	,address	,amount)
values
(6,'Nithesh', 'nk@gmail.com','8765449076','Chennai',4000.00);]
(Background on this error at: https://sqlalche.me/e/20/gkpj)

In [74]:
%%sql
select id , customer_name , amount
from CustomerData
where
    email is null or phone_number is null or amount is null or address is null;

 * mysql+mysqlconnector://root:***@localhost/test
4 rows affected.

[(2, 'Priya', None),
 (3, 'Arjun', Decimal('1500.00')),
 (4, 'Meena', Decimal('2500.00')),
 (5, 'Karthik', Decimal('3000.00'))]

Now we are going to use coalesce() - for entering values in null

the coalesce is the part of data aggregation, it should be declared in select

In [79]:
%%sql
select customer_name, amount , coalesce(amount ,'0.00') as replaced_values
from CustomerData

 * mysql+mysqlconnector://root:***@localhost/test
6 rows affected.

[('Ravi', Decimal('5000.00'), '5000.00'),
 ('Priya', None, '0.00'),
 ('Arjun', Decimal('1500.00'), '1500.00'),
 ('Meena', Decimal('2500.00'), '2500.00'),
 ('Karthik', Decimal('3000.00'), '3000.00'),
 ('Nithesh', Decimal('4000.00'), '4000.00')]

you can give n number of arguments in coalesce() , this is also similar to IFNULL this is also like coalesce but 
it allows only two arguments

In [80]:
%%sql
select customer_name, amount , ifnull (amount ,'0.00') as replaced_values
from CustomerData

 * mysql+mysqlconnector://root:***@localhost/test
6 rows affected.

[('Ravi', Decimal('5000.00'), '5000.00'),
 ('Priya', None, '0.00'),
 ('Arjun', Decimal('1500.00'), '1500.00'),
 ('Meena', Decimal('2500.00'), '2500.00'),
 ('Karthik', Decimal('3000.00'), '3000.00'),
 ('Nithesh', Decimal('4000.00'), '4000.00')]

String Handling

In [84]:
%%sql
select
length(customer_name) as name_length ,
upper(address) as city ,
lower(customer_name) as lower_case

from CustomerData order by name_length desc

 * mysql+mysqlconnector://root:***@localhost/test
6 rows affected.

[(7, None, 'karthik'),
 (7, 'CHENNAI', 'nithesh'),
 (5, 'BANGALORE', 'priya'),
 (5, 'HYDERABAD', 'arjun'),
 (5, 'MUMBAI', 'meena'),
 (4, 'CHENNAI', 'ravi')]

In [89]:
%%sql
select
concat(customer_name, " ",address , " ", "TN") as name_c,
substring(customer_name, 1 ,5) as name_prefix
from CustomerData ;

 * mysql+mysqlconnector://root:***@localhost/test
6 rows affected.

[('Ravi Chennai TN', 'Ravi'),
 ('Priya Bangalore TN', 'Priya'),
 ('Arjun Hyderabad TN', 'Arjun'),
 ('Meena Mumbai TN', 'Meena'),
 (None, 'Karth'),
 ('Nithesh Chennai TN', 'Nithe')]